

//Parallax
// var scene = document.getElementById('scene');
// var parallax = new Parallax(scene);



// data-relative-input Реагирует на движение мыши относительно положения элемента сцены.
// data-clip-relative-input Ограничивает реакцию на движение мыши за границами сцены до максимального значения, которое было бы возможно внутри ее элемента.
// data-hover-only Параллакс будет действовать только тогда, когда курсор находится над элементом сцены, иначе все слои вернутся в исходное положение. Лучше всего работает в сочетании с relativeInput.
// data-input-element Позволяет использовать другой элемент, движение курсора в котором задействует параллакс.
// calibrateX и calibrateY  Кэширует начальное значение оси X / Y при инициализации и вычисляет относительно этого движение.
// data-selector Селектор внутри сцены, для которого будет применен параллакс. При значении null будут перемещаться все ее прямые дочерние элементы